In [2]:
import numpy as np
import pandas as pd

In [3]:
#try time series!

In [4]:
life_expectancy = pd.read_csv('./raw_data/life_expectancy_years.csv')

In [6]:
life_expectancy.head() #1800 - 2018

,country,1800,1801,1802,1803,1804,1805,1806,1807,1808,...,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018
0,Afghanistan,28.2,28.2,28.2,28.2,28.2,28.2,28.1,28.1,28.1,...,55.7,56.2,56.7,57.2,57.7,57.8,57.9,58.0,58.4,58.7
1,Albania,35.4,35.4,35.4,35.4,35.4,35.4,35.4,35.4,35.4,...,75.9,76.3,76.7,77.0,77.2,77.4,77.6,77.7,77.9,78.0
2,Algeria,28.8,28.8,28.8,28.8,28.8,28.8,28.8,28.8,28.8,...,76.3,76.5,76.7,76.8,77.0,77.1,77.3,77.4,77.6,77.9
3,Andorra,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,82.7,82.7,82.6,82.6,82.6,82.6,82.5,82.5,NaN,NaN
4,Angola,27.0,27.0,27.0,27.0,27.0,27.0,27.0,27.0,27.0,...,59.3,60.1,60.9,61.7,62.5,63.3,64.0,64.7,64.9,65.2

In [5]:
life_expectancy.shape #187 countries, 220 years

(187, 220)

In [ ]:
#subsetting (from 2000 till 2010)
years = [str(i) for i in range(2000,2009)]
years.insert(0,'country')
co2 = co_2[[*years]]
co2.head()

In [6]:
#subsetting (2000 till 2015)
#years = [str(i) for i in range(2000,2016)]
#years.insert(0,'country')
#children_sub = children_per_woman[[*years]]
#children_sub.head()

In [7]:
#checking how many NaNs per country

life_noindex = life_expectancy.set_index('country')
life_transposed = life_noindex.T
life_null = life_transposed.isnull().sum()
life_null[life_null > 0]
print('These countries have some NaNs:',list(life_null [life_null > 0].index))

These countries have some NaNs: ['Andorra', 'Dominica', 'Marshall Islands']

In [8]:
life_null[['Andorra', 'Dominica', 'Marshall Islands']] #drop these countries?

country
Andorra             172
Dominica            172
Marshall Islands    172
dtype: int64

In [9]:
life_melt = life_expectancy.melt(id_vars=["country"])
life_melt.head()

       country variable  value
0  Afghanistan     1800   28.2
1      Albania     1800   35.4
2      Algeria     1800   28.8
3      Andorra     1800    NaN
4       Angola     1800   27.0

In [10]:
life_melt.sort_values(by=['country','variable'], inplace=True)
life_melt.head()

         country variable  value
0    Afghanistan     1800   28.2
187  Afghanistan     1801   28.2
374  Afghanistan     1802   28.2
561  Afghanistan     1803   28.2
748  Afghanistan     1804   28.2

In [11]:
life = life_melt.rename(columns={'country':'Country', 'variable':'Year', 'value':'life_expectancy'})
life.reset_index(inplace=True)
life.drop(columns=['index'], inplace=True)
life.head()

       Country  Year  life_expectancy
0  Afghanistan  1800             28.2
1  Afghanistan  1801             28.2
2  Afghanistan  1802             28.2
3  Afghanistan  1803             28.2
4  Afghanistan  1804             28.2

In [12]:
life.shape

(40953, 3)

In [13]:
life.isnull().sum()

Country              0
Year                 0
life_expectancy    516
dtype: int64

In [16]:
life.to_csv('/Users/filipalopes/Ironhack/PROJECTS/Supervised-Learning-Project/gapminder_data/treated_data/life_expectancy.csv')

In [15]:
(516/40953)*100

1.25998095377628